/*******************************************************************************
                      版权所有 (C), 2020-,NCUROBOT
 *******************************************************************************
  文 件 名   : printf_task.c
  版 本 号   : V1.0
  作    者   : GYH
  生成日期   : 2021.3.26
  最近修改   :
  功能描述   : 数据打印任务，将需要传输至上位机的数据通过虚拟示波器或串口打印传输至上位机
  函数列表   :	
*******************************************************************************/
/* 包含头文件 ----------------------------------------------------------------*/
#include "printf_task.h"
#include "usart_printf.h"

/* 内部宏定义 ----------------------------------------------------------------*/

/* 内部自定义数据类型的变量 --------------------------------------------------*/

/* 内部变量 ------------------------------------------------------------------*/

/* 内部函数原型声明 ----------------------------------------------------------*/

/* 函数主体部分 --------------------------------------------------------------*/
void Printf_Task(void const * argument)
{
  
	portTickType xLastWakeTime;
	xLastWakeTime = xTaskGetTickCount();

  for(;;)
	{
//    printf("round_get\r\n");
//虚拟示波器打印函数需要花费较多时间，且数据越多时间越长，故不建议反之重要任务中。
//若虚拟示波器打印数据为8个，则该任务周期应不低于5ms。    
    Virtual_Oscilloscope(0,0,0,0,0,0,0,0);
    
   	osDelayUntil(&xLastWakeTime,PRINTF_PERIOD);		 
  }
}


