/*******************************************************************************
                      版权所有 (C), 2020-,NCUROBOT
 *******************************************************************************
  文 件 名   : referee_task.c
  版 本 号   : V1.0
  作    者   : 高云海
  生成日期   : 2020.12.10
  最近修改   : 
  功能描述   : 裁判系统任务，待完善
  函数列表   : 1) Referee_Data_Task()			【FreeRTOS函数：操作系统任务调度运行】
*******************************************************************************/
/* 包含头文件 ----------------------------------------------------------------*/
#include "referee_task.h"
#include "offline_check.h"
/* 内部宏定义 ----------------------------------------------------------------*/

/* 内部自定义数据类型的变量 --------------------------------------------------*/

/* 内部变量 ------------------------------------------------------------------*/

/* 内部函数原型声明 ----------------------------------------------------------*/

/* 函数主体部分 --------------------------------------------------------------*/
/**
  * @brief				裁判系统任务(任务延时方式执行)
  * @param[in]		
	* @param[out]		
  * @retval				none
*/
void Referee_Data_Task(void const * argument)
{
//	  uint32_t NotifyValue;

		portTickType xLastWakeTime;
		xLastWakeTime = xTaskGetTickCount();
	
	for(;;)
	{
//		NotifyValue = ulTaskNotifyTake(pdTRUE,portMAX_DELAY);  //未有任务通知则进入堵塞状态去等待任务通知
		
//    if(NotifyValue == 1)
//		{
			Refresh_Task_OffLine_Time(RefereeDataTask_TOE);
			
//		}
		
		osDelayUntil(&xLastWakeTime, REFEREE_PERIOD);
	}
}
