/*******************************************************************************
                      版权所有 (C), 2020-,NCUROBOT
 *******************************************************************************
  文 件 名   : remote_control_task.c
  版 本 号   : V1.0
  作    者   : 高云海
  生成日期   : 2020.12.1
  最近修改   : 
  功能描述   : 遥控器数据进一步处理任务，包括判断是键鼠操作还是遥控器操作等。
							 （当USART1接收完一组数据时在空闲中断进行解码，并发送任务通知,然后
							 该任务方可运行，否则该任务处于阻塞状态，阻塞时间为4294967295ms即
							 约等于47天17小时。）
  函数列表   : 1) Remote_Data_Task()      【FreeRTOS函数：操作系统任务调度运行】  
*******************************************************************************/
/* 包含头文件 ----------------------------------------------------------------*/
#include "remote_control_task.h"
#include "offline_check.h"
/* 内部宏定义 ----------------------------------------------------------------*/

/* 内部自定义数据类型的变量 --------------------------------------------------*/

/* 内部变量 ------------------------------------------------------------------*/

/* 内部函数原型声明 ----------------------------------------------------------*/

/* 函数主体部分 --------------------------------------------------------------*/
/**
  * @brief				遥控器任务(任务通知方式执行)
  * @param[in]		
	* @param[out]		
  * @retval				none
*/
void Remote_Data_Task(void const * argument)
{
	 uint32_t NotifyValue;
//		portTickType xLastWakeTime;
//		xLastWakeTime = xTaskGetTickCount();	
	for(;;)
	{
		NotifyValue = ulTaskNotifyTake(pdTRUE,portMAX_DELAY);  //未有任务通知则进入堵塞状态去等待任务通知
		
    if(NotifyValue == 1)
		{
			Refresh_Task_OffLine_Time(RemoteDataTask_TOE);
			
		}
//		osDelayUntil(&xLastWakeTime, REMOTE_PERIOD);
		
	}
}
