/*******************************************************************************
                      版权所有 (C), 2020-,NCUROBOT
 *******************************************************************************
  文 件 名   : mecaum_calc.h
  版 本 号   : V1.0
  作    者   : NCUERM
  生成日期   : 2018年7月
  最近修改   : 
  功能描述   : 麦轮解算
							 注：待改进
  函数列表   : 1) Chassis_Vector_To_Mecanum_Wheel_Speed()   【外部调用：使用处】
*******************************************************************************/
/* 包含头文件 ----------------------------------------------------------------*/
#include "mecaum_calc.h"

/* 内部宏定义 ----------------------------------------------------------------*/

/* 内部自定义数据类型的变量 --------------------------------------------------*/

/* 内部变量 ------------------------------------------------------------------*/

/* 内部函数原型声明 ----------------------------------------------------------*/

/* 函数主体部分 --------------------------------------------------------------*/
/**
  * @brief				麦轮解算：四个麦轮速度是通过三个参数计算出来的
  * @param[out]		wheel_speed: 四个麦轮速度
  * @param[in]		Vx_set: 纵向速度
									Vy_set: 横向速度
	                Wz_set: 旋转速度	                
  * @retval				none
*/
void Chassis_Vector_To_Mecanum_Wheel_Speed(float  wheel[4],const float Vx_set,const float Vy_set,const float Wz_set)
{
			wheel[0] = (-Vx_set + Vy_set + Wz_set);
			wheel[1] = (-(Vx_set + Vy_set - Wz_set));
			wheel[2] = (-(-Vx_set + Vy_set - Wz_set));
			wheel[3] = (Vx_set + Vy_set + Wz_set);	
}
