#ifndef	 __MECAUM_CALC_H
#define	 __MECAUM_CALC_H

/* 包含头文件 ---------------------------------------------------------------*/
#include "myinclude.h"
/* 本模块向外部提供的宏定义 -------------------------------------------------*/

/* 本模块向外部提供的结构体/枚举定义 ----------------------------------------*/

/* 本模块向外部提供的变量声明 -----------------------------------------------*/

/* 本模块向外部提供的自定义数据类型变量声明 ---------------------------------*/

/* 本模块向外部提供的接口函数原型声明 ---------------------------------------*/
void Chassis_Vector_To_Mecanum_Wheel_Speed(float  wheel[4],const float Vx_set,const float Vy_set,const float Wz_set);



#endif

